# Join

In [1]:
import pandas as pd

In [6]:
var1=pd.DataFrame({"A":[2,34,23,41],"B":[78,6,90,98]})
var2=pd.DataFrame({"C":[23,6,3,7],"D":[23,53,42,56]})

In [10]:
var1.join(var2)

    A   B   C   D
0   2  78  23  23
1  34   6   6  53
2  23  90   3  42
3  41  98   7  56

In [11]:
var1=pd.DataFrame({"A":[2,34,23,41],"B":[78,6,90,98]})
var2=pd.DataFrame({"C":[23,6],"D":[23,53]})

In [12]:
var1.join(var2)

    A   B     C     D
0   2  78  23.0  23.0
1  34   6   6.0  53.0
2  23  90   NaN   NaN
3  41  98   NaN   NaN

In [17]:
var1=pd.DataFrame({"A":[2,34,23,41],"B":[78,6,90,98]},index=["a","b","c","d"])
var2=pd.DataFrame({"C":[23,6],"D":[23,53]},index=["a","b"])
var2.join(var1)

    C   D   A   B
a  23  23   2  78
b   6  53  34   6

In [18]:
var1=pd.DataFrame({"A":[2,34,23,41],"B":[78,6,90,98]},index=["a","b","c","d"])
var2=pd.DataFrame({"C":[23,6],"D":[23,53]},index=["a","b"])
var2.join(var1,how="left")

    C   D   A   B
a  23  23   2  78
b   6  53  34   6

In [20]:
var1=pd.DataFrame({"A":[2,34,23,41],"B":[78,6,90,98]},index=["a","b","c","d"])
var2=pd.DataFrame({"C":[23,6],"D":[23,53]},index=["a","b"])
var2.join(var1,how="right")

      C     D   A   B
a  23.0  23.0   2  78
b   6.0  53.0  34   6
c   NaN   NaN  23  90
d   NaN   NaN  41  98

In [21]:
var1=pd.DataFrame({"A":[2,34,23,41],"B":[78,6,90,98]},index=["a","b","c","d"])
var2=pd.DataFrame({"C":[23,6],"D":[23,53]},index=["a","b"])
var2.join(var1,how="outer")

      C     D   A   B
a  23.0  23.0   2  78
b   6.0  53.0  34   6
c   NaN   NaN  23  90
d   NaN   NaN  41  98

In [22]:
var1=pd.DataFrame({"A":[2,34,23,41],"B":[78,6,90,98]},index=["a","b","c","d"])
var2=pd.DataFrame({"C":[23,6],"D":[23,53]},index=["a","b"])
var2.join(var1,how="inner")

    C   D   A   B
a  23  23   2  78
b   6  53  34   6

In [25]:
var1=pd.DataFrame({"A":[2,34,23,41],"B":[78,6,90,98]},index=["a","b","c","d"])
var2=pd.DataFrame({"C":[23,6],"B":[23,53]},index=["a","b"])
var2.join(var1,how="outer",lsuffix="1",rsuffix="2")

      C    B1   A  B2
a  23.0  23.0   2  78
b   6.0  53.0  34   6
c   NaN   NaN  23  90
d   NaN   NaN  41  98

# Append

In [29]:
var1 = pd.DataFrame({"A": [2, 34, 23, 41], "B": [78, 6, 90, 98]})
var2 = pd.DataFrame({"C": [23, 6], "B": [23, 53]})

result = pd.concat([var1, var2])
print(result)

      A   B     C
0   2.0  78   NaN
1  34.0   6   NaN
2  23.0  90   NaN
3  41.0  98   NaN
0   NaN  23  23.0
1   NaN  53   6.0